Revit 2027 API
IFCExtrusionCalculatorUtils.CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) Method
 Calculates the extrusion data from a Revit geometry object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IFCExtrusionData> CalculateExtrusionData(
	IFCExtrusionCalculatorOptions extrusionOptions,
	GeometryObject geometryObject
)
Public Shared Function CalculateExtrusionData (
	extrusionOptions As IFCExtrusionCalculatorOptions,
	geometryObject As GeometryObject
) As IList(Of IFCExtrusionData)
public:
static IList<IFCExtrusionData^>^ CalculateExtrusionData(
	IFCExtrusionCalculatorOptions^ extrusionOptions,
	GeometryObject^ geometryObject
)
static member CalculateExtrusionData :
        extrusionOptions : IFCExtrusionCalculatorOptions *
        geometryObject : GeometryObject -> IList<IFCExtrusionData>
Parameters
extrusionOptions IFCExtrusionCalculatorOptions
 The options for extrusion extraction.
geometryObject GeometryObject
 The geometry object.
Return Value
IList<IFCExtrusionData>
 A collection of extrusion data calculated for the geometry. If the function fails to calculate one or more valid extrusions, this collection will be empty.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCExtrusionCalculatorUtils Class
CalculateExtrusionData Overload
Autodesk.Revit.DB.IFC Namespace